; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 819004 2 3 4 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image2 - mode
	thermograph3 - mode
	spectrograph1 - mode
	image0 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star1 - direction
	Star0 - direction
	Star4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument1 spectrograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph3)
	(supports instrument2 image2)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Phenomenon6 thermograph3)
	(have_image Planet7 image2)
	(have_image Phenomenon8 image0)
	(have_image Star9 image2)
	(have_image Planet10 image2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 star4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
4. (turn_to satellite0 star2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star2)
   goals met: 1 of 6
5. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 1 of 6
6. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   goals met: 0 of 6
7. (turn_to satellite1 star9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star9)
   goals met: 0 of 6
8. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 6
9. (take_image satellite1 star9 instrument2 image2)
   added: (have_image star9 image2)
   goals met: 1 of 6
10. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   goals met: 2 of 6
11. (turn_to satellite1 phenomenon6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 6
12. (turn_to satellite0 planet7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet7)
   goals met: 1 of 6
13. (take_image satellite1 phenomenon6 instrument2 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 2 of 6
14. (take_image satellite0 planet7 instrument0 image2)
   added: (have_image planet7 image2)
   goals met: 3 of 6
15. (turn_to satellite0 star2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star2)
   goals met: 4 of 6
16. (turn_to satellite1 planet10 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet10)
   goals met: 4 of 6
17. (take_image satellite1 planet10 instrument2 image2)
   added: (have_image planet10 image2)
   goals met: 5 of 6
18. (turn_to satellite0 phenomenon8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 6
19. (take_image satellite0 phenomenon8 instrument0 image0)
   added: (have_image phenomenon8 image0)
   goals met: 5 of 6
20. (turn_to satellite0 star2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star2)
   goals met: 6 of 6
